src/main/wsdl/accountRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.cloudhub.io/schemas/class/InchcapeAccountInterface_v1">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:sendAccount>
         <inc:Account>
            <inc:ExternalId>mounica-115</inc:ExternalId>
            <inc:RecordType>Dealer</inc:RecordType>
            <inc:ExternalEntityId>mounica-118</inc:ExternalEntityId>
            <inc:SourceSystem>VMS</inc:SourceSystem>
            <inc:BusinessId>Trivett Australia</inc:BusinessId>
            <inc:AccountStatus>Active</inc:AccountStatus>
            <inc:Salutation>Mr</inc:Salutation>
            <inc:FirstName>abc</inc:FirstName>
            <inc:LastName>def</inc:LastName>
  		  <inc:AccountName>Subaru Mentone</inc:AccountName>
      	  <inc:StandardAddressStreet>25 Nepean Hwy</inc:StandardAddressStreet>
      	  <inc:StandardAddressCity>Mentone</inc:StandardAddressCity>
      	  <inc:StandardAddressPostcode>3194</inc:StandardAddressPostcode>
   		  <inc:StandardAddressState>VIC</inc:StandardAddressState>
   		  <inc:StandardAddressCountry>Australia</inc:StandardAddressCountry>
    		  <inc:StandardAddressDPID>67726622</inc:StandardAddressDPID>
     	  <inc:StandardAddressValid>true</inc:StandardAddressValid>
       	  <inc:StandardAddressValidatedBy>DataTools</inc:StandardAddressValidatedBy>
       	  <inc:EmailAddress>abc@inchcape.com</inc:EmailAddress>
            <inc:EmailAddressValid>true</inc:EmailAddressValid>
            <inc:EmailAddressValidatedBy>DataTools</inc:EmailAddressValidatedBy>
            <inc:BusinessPhone>9999666358</inc:BusinessPhone>
            <inc:BusinessPhoneValid>true</inc:BusinessPhoneValid>
            <inc:BusinessPhoneValidatedBy>DataTools</inc:BusinessPhoneValidatedBy>
            <inc:MobilePhone>9999999999</inc:MobilePhone>
            <inc:MobilePhoneValid>false</inc:MobilePhoneValid>
            <inc:MobilePhoneValidatedBy>DataTools</inc:MobilePhoneValidatedBy>
         </inc:Account>
      </inc:sendAccount>
   </soapenv:Body>
</soapenv:Envelope>