src/test/resources/scaffolder/request/accountFailureRequest.xml



<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns ="http://www.cloudhub.io/schemas/class/InchcapeAccountInterface_v1">
   <soapenv:Header/>
   <soapenv:Body>
      <sendAccount>
         <Account>
            <ExternalId>mounica-115</ExternalId>
            <RecordType>Dealer</RecordType>
            <ExternalEntityId>mounica-118</ExternalEntityId>
            <SourceSystem>dsajlf</SourceSystem>
            
            <AccountStatus>Active</AccountStatus>
            <Salutation>Mr</Salutation>
            <FirstName>abc</FirstName>
            <LastName>def</LastName>
  		  <AccountName>Subaru Mentone</AccountName>
      	  <StandardAddressStreet>25 Nepean Hwy</StandardAddressStreet>
      	  <StandardAddressCity>Mentone</StandardAddressCity>
      	  <StandardAddressPostcode>3194</StandardAddressPostcode>
   		  <StandardAddressState>VIC</StandardAddressState>
   		  <StandardAddressCountry>Australia</StandardAddressCountry>
    		  <StandardAddressDPID>67726622</StandardAddressDPID>
     	  <StandardAddressValid>true</StandardAddressValid>
       	  <StandardAddressValidatedBy>DataTools</StandardAddressValidatedBy>
       	  <EmailAddress>abc@inchcape.com</EmailAddress>
            <EmailAddressValid>true</EmailAddressValid>
            <EmailAddressValidatedBy>DataTools</EmailAddressValidatedBy>
            <BusinessPhone>9999666358</BusinessPhone>
            <BusinessPhoneValid>true</BusinessPhoneValid>
            <BusinessPhoneValidatedBy>DataTools</BusinessPhoneValidatedBy>
            <MobilePhone>9999999999</MobilePhone>
            <MobilePhoneValid>false</MobilePhoneValid>
            <MobilePhoneValidatedBy>DataTools</MobilePhoneValidatedBy>
         </Account>
      </sendAccount>
   </soapenv:Body>
</soapenv:Envelope>  
